[
    {
        "content": "AI x Engineering - Transforming Organisational Capability for Sustainable Impact Tonkin Engineering GROUP NAME: MACCAS Yilin Chen Shuo Du Mohan Guo Shiying Shen Tongxuan Zhao Andrew Li Supervisor: Dr. Fabian Held Faculty of Science The University of Sydney Australia 17 August 2025",
        "metadata": {
            "source": "Team Agreement.pdf",
            "path": "/Users/erenk/Documents/USYD/2025 S1/SCPU3001/Tonkintelligent/data/projects/project_1/pdfs/Team Agreement.pdf",
            "page_number": 1
        }
    },
    {
        "content": "●​ Describe the agreed task your team will be working on together Our team will develop a prototype system that demonstrates how Tonkin’s unstructured legacy project data can be transformed into a structured and searchable knowledge base using artificial intelligence (AI). The focus will be on extracting content from documents (e.g., PDFs and scanned notes), organising that content using tagging and a knowledge graph structure, and enabling natural language search and question-answering through retrieval augmented generation (RAG) techniques. This prototype will show how Tonkin staff could retrieve relevant project insights more efficiently, supporting better reuse of past work and improving decision-making. ●​ Identify the task milestones you have agreed to meet ​Milestone 1: Analyse the data provided and choose appropriate tagging and knowledge graph methods​ ​Milestone 2: Test the tagging and the knowledge graph to collect all important connections in the data Milestone 3: Find an appropriate pretrained model and deploy it locally​ ​Milestone 4: Implement RAG using the knowledge graph with the model​ ​Milestone 5: Test the system using real data ●​ Identify the strengths, background or expertise each team member brings to the team ​Yilin Chen: I have a background in computer science and mathematics, with a strong focus on machine learning. I have good knowledge of multimodal AI techniques, including natural language processing (NLP) and computer vision (CV), and experience in implementing, pretraining, and fine-tuning models. Shuo Du: I have a background in medical science, perhaps my programming skills are not good. I can handle some miscellaneous tasks such as recognizing or correcting handwritten notes. Mohan Guo: I have a background in computer science and data science, with experience in training computer vision models. I can provide support in AI fundamentals and model development. ​Shiying Shen: I have a background in Computer Science and Data Science, with expertise in data visualization, artificial intelligence and proficiency in multiple programming languages. ​Tongxuan Zhao: I have a background in Data Science, I can contribute by handling data cleaning, building models, and interpreting results for decision-making. Andrew Li: I have a background in Data Science, specialized in machine learning, exploratory data analysis and data visualization. I am capable of",
        "metadata": {
            "source": "Team Agreement.pdf",
            "path": "/Users/erenk/Documents/USYD/2025 S1/SCPU3001/Tonkintelligent/data/projects/project_1/pdfs/Team Agreement.pdf",
            "page_number": 2
        }
    },
    {
        "content": "structuring complex project information into clear, organized formats and visualizing the relationships between data entities. ●​ Identify any factors each team member may have that could impact completion of the task Yilin Chen: I may have academic commitments for my Honours project and thesis that could affect time availability during peak periods. I also do not have prior experience with knowledge graph technologies, which may require some time for self-learning and researching. Shuo Du: Due to my limited medical background knowledge, it seems that it is not closely related to the requirements of this task. During this work process, I may not offer many suggestions. I might need to self-study some content about how to train AI to enhance my ability to complete the work. Mohan Guo: One potential factor is that I am currently seeking jobs this semester, so interviews may occasionally conflict with our meeting times. In addition, unexpected events such as illness or injury could also impact my availability. ​Shiying Shen: I selected double majors, and this is my last semester. Therefore, I have two capstone courses to complete, which might require coordination of meeting times. At the same time, I am also looking for an internship after graduation. I need to prepare for the interview and the actual interview, which will take up a lot of my time. ​Tongxuan Zhao: I am in my final semester of undergraduate study, and my course schedule is relatively full. However, the overall workload from other courses is not very heavy, so I expect only occasional time conflicts with our project. Andrew Li: While I’m actively seeking internship opportunities, which may occasionally affect my availability for team meetings, I remain committed to contributing to the project and will coordinate my schedule to stay aligned with our milestones. ●​ Describe how you will manage the elements of the task as a team, how will you arrive at a cohesive outcome? We will manage the project by following a structured plan aligned with our agreed milestones. Tasks will be divided based on individual strengths and interests, while ensuring collaboration and alignment at each stage. We will maintain clear documentation of decisions, progress, and technical choices to ensure consistency and transparency through a shared Google Drive. Regular check-ins will be used - one on Friday on campus and the other on Tuesday",
        "metadata": {
            "source": "Team Agreement.pdf",
            "path": "/Users/erenk/Documents/USYD/2025 S1/SCPU3001/Tonkintelligent/data/projects/project_1/pdfs/Team Agreement.pdf",
            "page_number": 3
        }
    },
    {
        "content": "via Zoom - to synchronise progress and make adjustments as needed, helping us produce a cohesive and well-integrated final outcome. ●​ Decide how all team members will share responsibility for the culture of the team, the process and the product We will take collective responsibility for maintaining a respectful, inclusive, and productive team environment. Each member is expected to contribute actively to the project, communicate openly, and support one another throughout the process. We will commit to a consistent and organised workflow, ensuring that everyone understands their responsibilities and stays aligned with the project goals. All team members will share accountability for the quality of the final product, and we will aim to uphold high standards in both our collaboration and technical outcomes. ●​ Outline an agreed method for peer feedback during the project so that problems can be addressed before the project ends We will incorporate regular peer feedback to ensure good collaboration and address any issues early. Feedback will be shared during our two weekly check-ins, with an emphasis on constructive suggestions and shared reflection. In addition to these two major check-ins, we will use our WeChat group chat to discuss and cope with any collaborative or technical problems immediately between meetings. If there are significant issues, we will conduct an extra check-in to try to address them as early as possible. ●​ Outline strategies for dealing with conflict or problems as they arise We will address conflicts or problems as soon as they arise, starting with open and respectful discussion among the involved team members. If needed, we will bring the issue to the next scheduled check-in or organise an additional meeting to resolve it promptly. We will focus on understanding the core issue and finding a fair and practical solution that supports the team’s progress. If a problem cannot be resolved internally, we will seek support from our project supervisors as a last resort. ●​ Outline points at which to reflect on your progress and celebrate your wins! We will reflect on our progress and celebrate achievements at key project milestones. After completing each milestone, we will pause to review what",
        "metadata": {
            "source": "Team Agreement.pdf",
            "path": "/Users/erenk/Documents/USYD/2025 S1/SCPU3001/Tonkintelligent/data/projects/project_1/pdfs/Team Agreement.pdf",
            "page_number": 4
        }
    },
    {
        "content": "has been accomplished, identify areas for improvement, and acknowledge individual and team contributions. In particular, we will celebrate the successful completion of major stages such as finalising the data analysis, building a working prototype, and delivering the final system demonstration. This approach will help us stay motivated, maintain team spirit, and ensure continuous learning throughout the project.",
        "metadata": {
            "source": "Team Agreement.pdf",
            "path": "/Users/erenk/Documents/USYD/2025 S1/SCPU3001/Tonkintelligent/data/projects/project_1/pdfs/Team Agreement.pdf",
            "page_number": 5
        }
    }
]